fix(posts): update keycloak identity post
Signed-off-by: Bruce Becker <brucellino@protonmail.ch>
