--- a/_posts/2026-08-27-platform-identity.md
+++ b/_posts/2026-08-27-platform-identity.md
@@ -51,41 +51,51 @@ We are going to call this the _"Identity Architecture_".
-</pre>
+The context of the platform identity service is shown in the diagram below, where it is designated "Authentication and Authorisation Service".
 
 ```plantuml
-@startuml
 
-!include C4_Context.puml
+{% include diagrams/identity-arch-1.puml %}
 
-LAYOUT_WITH_LEGEND()
-
-title Platform Identity and Authorisation system
-
-Boundary(org, "Organisation") {
-  Person(platformUser, "Platform user", $sprite="person2")
-  System(IdP, "Identity Provider")
-}
-
-Boundary(platform, "Platform Services") {
-  Person(platformOperator, "Platform Operator")
-  Person(platformOwner, "Platform Owner")
-  System(Service, "Platform Service")
-  System(AAI, "Authentication and Authorisation Service")
-}
-
-Rel(platformUser, Service, "Access")
-BiRel(Service, AAI, "Request Access Permissions")
-BiRel(AAI, IdP, "Request Credentials")
-Rel(platformUser, IdP, "Provide Credentials")
-Rel(IdP, AAI, "Authenticate")
-Rel(Service, platformUser, "Authorise")
-Rel(platformOwner, AAI, "Define access policies and permissions")
-Rel(platformOperator, Service, "Deploy and Configure")
-@end
 ```
+
+In this context, someone wishing to access one of the Platform Services[^NotWorkloads] is redirected to the AAI, which then requests authentication of the user at their organisatin's identity provider (IdP).
+After successful authentication, the AAI looks up what the user's attributes as defined in the authorisation realm, and then passes those to the service which the user initally wanted to use.
+The service's policies then map those attributes to permissions and roles in its context, and authorises the user to access it with those same permissions and roles.
+
+This is shown in the sequence diagram below:
+
+```seqdiag
+seqdiag {
+  User -> Service [label = "Request Service"];
+  Service -> AAI [label = "Request AuthN/Z"];
+  AAI -> IdP [label = "Authenticate User"];
+  User -> IdP [label = "Provide Credentials"];
+  IdP -> AAI [label = "Return Identity"];
+  AAI -> Service [label = "Provide Attributes"];
+  User <- Service [label = "Authorise with policy"];
+}
+```
+
+As the platform owners, we need to deploy the AAI service, synonymous with "Platform Identity".
+This means we are responsible for issuing standard-based attributes to authenticated identities, so that services can decide what permissions and roles to assign to those identities.
